tiborsimon/embedded-tdd-headers/pic/8bit/pic18f87j93_tdd.h
#define SEG40COM3                     522
#define SEG41COM3                     523
#define S41C3                         524
#define S42C3                         525
#define SEG42COM3                     526
#define SEG43COM3                     527
#define S43C3                         528
#define SEG44COM3                     529
#define S44C3                         530
#define S45C3                         531
#define SEG45COM3                     532
#define S46C3                         533
#define SEG46COM3                     534
#define S47C3                         535
#define SEG47COM3                     536
#define BAUDCON1                      537
#define ABDEN1                        538
#define ABDEN                         539
#define WUE1                          540
#define W4E                           541
#define WUE                           542
#define BRG161                        543
#define BRG16                         544
#define CKTXP                         545
#define SCKP1                         546
#define TXCKP                         547
#define TXCKP1                        548
#define SCKP                          549
#define DTRXP1                        550
#define RXDTP1                        551
#define DTRXP                         552
#define RXCKP                         553
#define RXDTP                         554
#define RCMT1                         555
#define RCIDL1                        556
#define RCIDL                         557
#define RCMT                          558
#define ABDOVF                        559
#define ABDOVF1                       560
#define SPBRGH1                       561
#define PORTA                         562
#define AN0                           563
#define ULPWUIN                       564
#define RA0                           565
#define SEG18                         566
#define AN1                           567
#define RA1                           568
#define AN2                           569
#define VREFM                         570
#define RA2                           571
#define AN3                           572
#define RA3                           573
#define VREFP                         574
#define TOCKI                         575
#define SEG14                         576
#define RA4                           577
#define SEG15                         578
#define AN4                           579
#define LVDIN                         580
#define RA5                           581
#define CLKO                          582
#define RA6                           583
#define OSC2                          584
#define CLKI                          585
#define PORTA_RJPU                    586
#define OSC1                          587
#define RA7                           588
#define PORTB                         589
#define SEG30                         590
#define RB0                           591
#define INT0                          592
#define RB1                           593
#define INT1                          594
#define SEG8                          595
#define RB2                           596
#define INT2                          597
#define CTED1                         598
#define SEG9                          599
#define SEG10                         600
#define RB3                           601
#define INT3                          602
#define CCP2_PA2                      603
#define CTED2                         604
#define SEG11                         605
#define RB4                           606
#define KBI0                          607
#define RB5                           608
#define SEG29                         609
#define KBI1                          610
#define PGC                           611
#define RB6                           612
#define KBI2                          613
#define PGD                           614
#define RB7                           615
#define KBI3                          616
#define PORTC                         617
#define T13CKI                        618
#define T1OSO                         619
#define RC0                           620
#define SEG32                         621
#define PORTC_CCP2                    622
#define T1OSI                         623
#define PA2                           624
#define RC1                           625
#define SEG13                         626
#define CCP1                          627
#define PA1                           628
#define RC2                           629
#define SEG17                         630
#define SCL                           631
#define SCK                           632
#define RC3                           633
#define SEG16                         634
#define RC4                           635
#define SDA                           636
#define SDI                           637
#define SEG12                         638
#define RC5                           639
#define SDO                           640
#define SEG27                         641
#define TX1                           642
#define RC6                           643
#define CK1                           644
#define RX1                           645
#define SEG28                         646
#define RC7                           647
#define DT1                           648
#define PORTD                         649
#define RD0                           650
#define SEG0                          651
#define CTPLS                         652
#define RD1                           653
#define SEG1                          654
#define RD2                           655
#define SEG2                          656
#define RD3                           657
#define SEG3                          658
#define RD4                           659
#define SEG4                          660
#define RD5                           661
#define SEG5                          662
#define RD6                           663
#define SEG6                          664
#define RD7                           665
#define SEG7                          666
#define SS2                           667
#define PORTE                         668
#define PD2                           669
#define RDE                           670
#define LCDBIAS1                      671
#define RE0                           672
#define WRE                           673
#define LCDBIAS2                      674
#define PC2                           675
#define RE1                           676
#define COM0                          677
#define CCP9E                         678
#define RE3                           679
#define PC3E                          680
#define PB3E                          681
#define COM1                          682
#define RE4                           683
#define CCP8E                         684
#define COM2                          685
#define CCP7E                         686
#define RE5                           687
#define PC1E                          688
#define CCP6E                         689
#define COM3                          690
#define RE6                           691
#define PB1E                          692
#define PORTE_CCP2                    693
#define CCP2E                         694
#define SEG31                         695
#define PA2E                          696
#define RE7                           697
#define PORTF                         698
#define SEG19                         699
#define AN6                           700
#define PORTF_C2OUT                   701
#define RF1                           702
#define C1OUTF                        703
#define PORTF_C1OUT                   704
#define C2OUTF                        705
#define AN7                           706
#define RF2                           707
#define SEG20                         708
#define AN8                           709
#define RF3                           710
#define SEG21                         711
#define C2INB                         712
#define AN9                           713
#define RF4                           714
#define SEG22                         715
#define C2INA                         716
#define C1INB                         717
#define RF5                           718
#define SEG23                         719
#define CVREF                         720
#define AN10                          721
#define C1INA                         722
#define RF6                           723
#define SEG24                         724
#define AN11                          725
#define SS1                           726
#define AN5                           727
#define RF7                           728
#define SEG25                         729
#define PORTG                         730
#define LCDBIAS0                      731
#define RG0                           732
#define C3OUTG                        733
#define TX2                           734
#define RG1                           735
#define CK2                           736
#define VLCAP1                        737
#define RX2                           738
#define RG2                           739
#define DT2                           740
#define VLCAP2                        741
#define RG3                           742
#define SEG26                         743
#define RG4                           744
#define RTCC                          745
#define PORTG_RJPU                    746
#define RG5                           747
#define REPU                          748
#define RG6                           749
#define RDPU                          750
#define RG7                           751
#define PORTH                         752
#define RH0                           753
#define SEG47                         754
#define RH1                           755
#define SEG46                         756
#define RH2                           757
#define SEG45                         758
#define RH3                           759
#define SEG44                         760
#define RH4                           761
#define CCP9                          762
#define SEG40                         763
#define PC3                           764
#define RH5                           765
#define CCP8                          766
#define PB3                           767
#define SEG41                         768
#define RH6                           769
#define CCP7                          770
#define SEG42                         771
#define PC1                           772
#define RH7                           773
#define CCP6                          774
#define PB1                           775
#define SEG43                         776
#define PORTJ                         777
#define RJ0                           778
#define RJ1                           779
#define SEG33                         780
#define RJ2                           781
#define SEG34                         782
#define RJ3                           783
#define SEG35                         784
#define RJ4                           785
#define SEG39                         786
#define RJ5                           787
#define SEG38                         788
#define RJ6                           789
#define SEG37                         790
#define RJ7                           791
#define SEG36                         792
#define LATA                          793
#define LATA0                         794
#define LA0                           795
#define LATA1                         796
#define LA1                           797
#define LATA2                         798
#define LA2                           799
#define LATA3                         800
#define LA3                           801
#define LATA4                         802
#define LA4                           803
#define LATA5                         804
#define LA5                           805
#define LATA6                         806
#define LA6                           807
#define LATA7                         808
#define LA7                           809
#define LATB                          810
#define LB0                           811
#define LATB0                         812
#define LB1                           813
#define LATB1                         814
#define LB2                           815
#define LATB2                         816
#define LB3                           817
#define LATB3                         818
#define LB4                           819
#define LATB4                         820
#define LB5                           821
#define LATB5                         822
#define LB6                           823
#define LATB6                         824
#define LB7                           825
#define LATB7                         826
#define LATC                          827
#define LATC0                         828
#define LC0                           829
#define LATC1                         830
#define LC1                           831
#define LATC2                         832
#define LC2                           833
#define LATC3                         834
#define LC3                           835
#define LATC4                         836
#define LC4                           837
#define LATC5                         838
#define LC5                           839
#define LATC6                         840
#define LC6                           841
#define LATC7                         842
#define LC7                           843
#define LATD                          844
#define LATD0                         845
#define LD0                           846
#define LATD1                         847
#define LD1                           848
#define LATD2                         849
#define LD2                           850
#define LATD3                         851
#define LD3                           852
#define LATD4                         853
#define LD4                           854
#define LATD5                         855
#define LD5                           856
#define LATD6                         857
#define LD6                           858
#define LATD7                         859
#define LD7                           860
#define LATE                          861
#define LATE0                         862
#define LE0                           863
#define LATE1                         864
#define LE1                           865
#define LATE3                         866
#define LE3                           867
#define LATE4                         868
#define LE4                           869
#define LATE5                         870
#define LE5                           871
#define LATE6                         872
#define LE6                           873
#define LATE7                         874
#define LE7                           875
#define LATF                          876
#define LATF1                         877
#define LF1                           878
#define LF2                           879
#define LATF2                         880
#define LF3                           881
#define LATF3                         882
#define LF4                           883
#define LATF4                         884
#define LF5                           885
#define LATF5                         886
#define LF6                           887
#define LATF6                         888
#define LF7                           889
#define LATF7                         890
#define LATG                          891
#define LATG0                         892
#define LG0                           893
#define LATG1                         894
#define LG1                           895
#define LG2                           896
#define LATG2                         897
#define LATG3                         898
#define LG3                           899
#define LATG4                         900
#define LG4                           901
#define U1OD                          902
#define U2OD                          903
#define LATH                          904
#define LH0                           905
#define LATH0                         906
#define LH1                           907
#define LATH1                         908
#define LH2                           909
#define LATH2                         910
#define LH3                           911
#define LATH3                         912
#define LH4                           913
#define LATH4                         914
#define LH5                           915
#define LATH5                         916
#define LH6                           917
#define LATH6                         918
#define LH7                           919
#define LATH7                         920
#define LATJ                          921
#define LATJ0                         922
#define LJ0                           923
#define LATJ1                         924
#define LJ1                           925
#define LATJ2                         926
#define LJ2                           927
#define LATJ3                         928
#define LJ3                           929
#define LATJ4                         930
#define LJ4                           931
#define LATJ5                         932
#define LJ5                           933
#define LATJ6                         934
#define LJ6                           935
#define LATJ7                         936
#define LJ7                           937
#define TRISA                         938
#define TRISA0                        939
#define TRISA1                        940
#define TRISA2                        941
#define TRISA3                        942
#define TRISA4                        943
#define TRISA5                        944
#define TRISA6                        945
#define TRISA7                        946
#define TRISB                         947
#define TRISB0                        948
#define TRISB1                        949
#define TRISB2                        950
#define TRISB3                        951
#define TRISB4                        952
#define TRISB5                        953
#define TRISB6                        954
#define TRISB7                        955
#define TRISC                         956
#define TRISC0                        957
#define TRISC1                        958
#define TRISC2                        959
#define TRISC3                        960
#define TRISC4                        961
#define TRISC5                        962
#define TRISC6                        963
#define TRISC7                        964
#define TRISD                         965
#define TRISD0                        966
#define TRISD1                        967
#define TRISD2                        968
#define TRISD3                        969
#define TRISD4                        970
#define TRISD5                        971
#define TRISD6                        972
#define TRISD7                        973
#define TRISE                         974
#define TRISE0                        975
#define TRISE1                        976
#define TRISE3                        977
#define TRISE4                        978
#define TRISE5                        979
#define TRISE6                        980
#define TRISE7                        981
#define TRISF                         982
#define TRISF1                        983
#define TRISF2                        984
#define TRISF3                        985
#define TRISF4                        986
#define TRISF5                        987
#define TRISF6                        988
#define TRISF7                        989
#define TRISG                         990
#define TRISG0                        991
#define TRISG1                        992
#define TRISG2                        993
#define TRISG3                        994
#define TRISG4                        995
#define CCP1OD                        996
#define CCP2OD                        997
#define SPIOD                         998
#define TRISH                         999
#define TRISH0                        1000
#define TRISH1                        1001
#define TRISH2                        1002
#define TRISH3                        1003
#define TRISH4                        1004
#define TRISH5                        1005
#define TRISH6                        1006
#define TRISH7                        1007
#define TRISJ                         1008
#define TRISJ0                        1009
#define TRISJ1                        1010
#define TRISJ2                        1011
#define TRISJ3                        1012
#define TRISJ4                        1013
#define TRISJ5                        1014
#define TRISJ6                        1015
#define TRISJ7                        1016
#define OSCTUNE                       1017
#define TUN0                          1018
#define TUN                           1019
#define TUN1                          1020
#define TUN2                          1021
#define TUN3                          1022
#define TUN4                          1023
#define TUN5                          1024
#define PLLEN                         1025
#define INTSRC                        1026
#define PIE1                          1027
#define TMR1IE                        1028
#define TMR2IE                        1029
#define SSPIE                         1030
#define SSP1IE                        1031
#define TXIE                          1032
#define TX1IE                         1033
#define RCIE                          1034
#define RC1IE                         1035
#define ADIE                          1036
#define PIR1                          1037
#define TMR1IF                        1038
#define TMR2IF                        1039
#define SSP1IF                        1040
#define SSPIF                         1041
#define TXIF                          1042
#define TX1IF                         1043
#define RCIF                          1044
#define RC1IF                         1045
#define ADIF                          1046
#define IPR1                          1047
#define TMR1IP                        1048
#define TMR2IP                        1049
#define SSPIP                         1050
#define SSP1IP                        1051
#define TX1IP                         1052
#define TXIP                          1053
#define RCIP                          1054
#define RC1IP                         1055
#define ADIP                          1056
#define PIE2                          1057
#define TMR3IE                        1058
#define LVDIE                         1059
#define BCLIE                         1060
#define BCL1IE                        1061
#define CMIE                          1062
#define OSCFIE                        1063
#define PIR2                          1064
#define TMR3IF                        1065
#define LVDIF                         1066
#define BCL1IF                        1067
#define BCLIF                         1068
#define CMIF                          1069
#define OSCFIF                        1070
#define IPR2                          1071
#define TMR3IP                        1072
#define LVDIP                         1073
#define BCL1IP                        1074
#define BCLIP                         1075
#define CMIP                          1076
#define OSCFIP                        1077
#define PIE3                          1078
#define RTCCIE                        1079
#define RXB0IE                        1080
#define RXBNIE                        1081
#define CCP1IE                        1082
#define RXB1IE                        1083
#define CCP2IE                        1084
#define TXB0IE                        1085
#define CTMUIE                        1086
#define TXB1IE                        1087
#define TXB2IE                        1088
#define TXBNIE                        1089
#define TX2IE                         1090
